(* TEST
expect;
*)


let set_geometry n =
  Format.set_geometry ~max_indent:(n-2) ~margin:n

let test n s =
  set_geometry n;
  Format.printf "@[%a@]@." Format.pp_print_text s
[%%expect {|
val set_geometry : int -> unit = <fun>
val test : int -> string -> unit = <fun>
|}]

(** Default output *)

let () =
  test 40
  "Μῆνιν ἄειδε θεὰ Πηληϊάδεω Ἀχιλῆος οὐλομένην, ἣ μυρί᾿ Ἀχαιοῖς ἄλγε᾿ ἔθηκε, \
   πολλὰς δ᾿ ἰφθίμους ψυχὰς Ἄϊδι προΐαψεν ἡρώων, αὐτοὺς δὲ ἑλώρια τεῦχε κύνεσσιν \
   οἰωνοῖσί τε πᾶσι· Διὸς δ᾿ ἐτελείετο βουλή ἐξ οὗ δὴ τὰ πρῶτα διαστήτην \
   ἐρίσαντε Ἀτρεΐδης τε ἄναξ ἀνδρῶν καὶ δῖος Ἀχιλλεύς."
[%%expect {|
Μῆνιν ἄειδε θεὰ
Πηληϊάδεω Ἀχιλῆος
οὐλομένην, ἣ μυρί᾿
Ἀχαιοῖς ἄλγε᾿
ἔθηκε, πολλὰς δ᾿
ἰφθίμους ψυχὰς
Ἄϊδι προΐαψεν
ἡρώων, αὐτοὺς δὲ
ἑλώρια τεῦχε
κύνεσσιν οἰωνοῖσί
τε πᾶσι· Διὸς δ᾿
ἐτελείετο βουλή ἐξ
οὗ δὴ τὰ πρῶτα
διαστήτην ἐρίσαντε
Ἀτρεΐδης τε ἄναξ
ἀνδρῶν καὶ δῖος
Ἀχιλλεύς.
|}]

let () =
  test 40
    "めぐり逢ひ \
     見しやそれとも \
     わかぬ間に \
     雲隠れにし"
[%%expect {|
めぐり逢ひ 見しやそれとも
わかぬ間に 雲隠れにし
|}]

(** Width = number of unicode characters in utf8 string *)
let out_width s ~pos ~len =
  let rec width s count current last =
    if current >= last then count
    else
      let decode = String.get_utf_8_uchar s current in
      let advance = Uchar.utf_decode_length decode in
      width s (count + 1) (current+advance) last
  in
  width s 0 pos (pos + len)

let setup () =
  let fns = Format.get_formatter_out_functions () in
  Format.set_formatter_out_functions  { fns with out_width }

[%%expect {|
val out_width : String.t -> pos:int -> len:int -> int = <fun>
val setup : unit -> unit = <fun>
|}]

let () =
  setup ();
  test 40
  "Μῆνιν ἄειδε θεὰ Πηληϊάδεω Ἀχιλῆος οὐλομένην, ἣ μυρί᾿ Ἀχαιοῖς ἄλγε᾿ ἔθηκε, \
   πολλὰς δ᾿ ἰφθίμους ψυχὰς Ἄϊδι προΐαψεν ἡρώων, αὐτοὺς δὲ ἑλώρια τεῦχε κύνεσσιν \
   οἰωνοῖσί τε πᾶσι· Διὸς δ᾿ ἐτελείετο βουλή ἐξ οὗ δὴ τὰ πρῶτα διαστήτην \
   ἐρίσαντε Ἀτρεΐδης τε ἄναξ ἀνδρῶν καὶ δῖος Ἀχιλλεύς."
[%%expect {|
Μῆνιν ἄειδε θεὰ Πηληϊάδεω Ἀχιλῆος
οὐλομένην, ἣ μυρί᾿ Ἀχαιοῖς ἄλγε᾿ ἔθηκε,
πολλὰς δ᾿ ἰφθίμους ψυχὰς Ἄϊδι προΐαψεν
ἡρώων, αὐτοὺς δὲ ἑλώρια τεῦχε κύνεσσιν
οἰωνοῖσί τε πᾶσι· Διὸς δ᾿ ἐτελείετο
βουλή ἐξ οὗ δὴ τὰ πρῶτα διαστήτην
ἐρίσαντε Ἀτρεΐδης τε ἄναξ ἀνδρῶν καὶ
δῖος Ἀχιλλεύς.
|}]


let () =
  setup ();
  set_geometry 40;
  Format.printf
    "@[Μῆνιν@ ἄειδε@ θεὰ@ Πηληϊάδεω@ Ἀχιλῆος@ οὐλομένην,@ ἣ@ μυρί᾿@ Ἀχαιοῖς@ ἄλγε᾿@ ἔθηκε,@ \
     πολλὰς@ δ᾿@ ἰφθίμους@ ψυχὰς@ Ἄϊδι@ προΐαψεν@ ἡρώων,@ αὐτοὺς@ δὲ@ ἑλώρια@ τεῦχε@ \
     κύνεσσιν@ οἰωνοῖσί@ τε@ πᾶσι·@ Διὸς@ δ᾿@ ἐτελείετο@ βουλή@ ἐξ@ οὗ@ δὴ@ τὰ@ πρῶτα@ \
     διαστήτην@ ἐρίσαντε@ Ἀτρεΐδης@ τε@ ἄναξ@ ἀνδρῶν@ καὶ@ δῖος@ Ἀχιλλεύς.@]@."
[%%expect {|
Μῆνιν ἄειδε θεὰ Πηληϊάδεω Ἀχιλῆος
οὐλομένην, ἣ μυρί᾿ Ἀχαιοῖς ἄλγε᾿ ἔθηκε,
πολλὰς δ᾿ ἰφθίμους ψυχὰς Ἄϊδι προΐαψεν
ἡρώων, αὐτοὺς δὲ ἑλώρια τεῦχε κύνεσσιν
οἰωνοῖσί τε πᾶσι· Διὸς δ᾿ ἐτελείετο
βουλή ἐξ οὗ δὴ τὰ πρῶτα διαστήτην
ἐρίσαντε Ἀτρεΐδης τε ἄναξ ἀνδρῶν καὶ
δῖος Ἀχιλλεύς.
|}]


let () =
  setup ();
  test 40
    "めぐり逢ひ \
     見しやそれとも \
     わかぬ間に \
     雲隠れにし"
[%%expect {|
めぐり逢ひ 見しやそれとも わかぬ間に 雲隠れにし
|}]
